//kjs.js
//获取应用实例
var app = getApp();

var testData = [
  [{num: 2100, p: 300}, {num: 2100, p: 300}, {num: 2100, p: 300}, {num: 2100, p: 300}, {num: 2100, p: 300}],
  [{num: 2200, p: 300}, {num: 2200, p: 300}, {num: 2100, p: 300}, {num: 2100, p: 300}, {num: 2100, p: 300}],
  [{num: 2300, p: 300}, {num: 2300, p: 300}, {num: 2100, p: 300}, {num: 2100, p: 300}, {num: 2100, p: 300}],
  [{num: 2400, p: 300}, {num: 2400, p: 300}, {num: 2100, p: 300}, {num: 2100, p: 300}, {num: 2100, p: 300}]
];

var weekData = [
  '第一周',
  '第二周',
  '第三周',
  '第四周',
  '第五周',
  '第六周',
  '第七周',
  '第八周',
  '第九周',
  '第十周',
  '第十一周',
  '第十二周',
  '第十三周',
  '第十四周',
  '第十五周',
  '第十六周',
  '第十七周'
];

Page({
  data: {
    weekData: weekData,
    testData: testData
  },
  onReady: function(){

  }
});